Repository: nobodyinperson/co2monitor
Catalog: usr/share/co2monitor/lang/*/LC_MESSAGES/co2monitor.po
Languages: de, fr

source: Welcome to Co2monitor!
de: Willkommen bei Co2monitor!
fr: Bienvenue à Co2monitor!

source: Starting GLib main loop...
de: starte GLib Hautpschleife...
fr: lance GLib boucle...

source: GLib main loop ended.
de: GLib Hauptschleife beendet.
fr: GLib boucle terminé.

source: Received quitting signal.
de: Anhaltesignal erhalten.
fr: reçu signal de interruption.

source: Device file '{}' does not exist.
de: Gerätedatei '{}' existiert nicht.
fr: Fichier d'appareil '{}' n'existe pas.

source: Checksum error
de: Prüfsummenfehler
fr: erreur de somme de contrôle

source: (never mind if {}
de: (egal, wenn '{}'
fr: (Ne t'en fais pas, si {}

source: is the correct co2monitor device node...)
de: die korrekte co2monitor Gerätedatei ist...)
fr: est l'appareil correct...)

source: opening co2 device file '{}'
de: öffne co2-Gerätedatei '{}'
fr: ouvert fichier d'appareil '{}'

source: device '{}' does not exist.
de: Gerätedatei '{}' existiert nicht.
fr: L'appareil '{}' n'existe pas.

source: closing co2 device file '{}'
de: schließe co2-Gerätedatei '{}'
fr: ferme fichier d'appareil '{}'...

source: Could not read from device '{}'
de: Konnte nicht von Gerätedatei '{}' lesen
fr: Ne pourrais pas lire de l'appareil '{}'

source: Trying to reconnect...
de: Versuche Neuverbindung...
fr: Essai de reconnexion...

source: Could not reconnect. Aborting.
de: Konnte nicht wiederverbinden. Abbruch.
fr: Ne pourrais pas reconnecter. Interruption.

source: received stop signal {},
de: Anhaltesignal {} erhalten,
fr: reçu signal stop {}

source: will terminate soon...
de: werde bald anhalten...
fr: ja vais arrêter bientôt...

source: Service running...
de: Service läuft...
fr: Le service marche...

source: Service stopped
de: Service beendet
fr: Le service a terminé.

source: received request to start logging on device {}
de: Anweisung erhalten, Daten von Gerät {} zu loggen

source: There is already a logging thread for device {}.
de: Es läuft bereits ein Datenaufzeichnungsthread für Gerät {}.

source: This is odd... I better do nothing.
de: Das ist seltsam... Ich tue besser nichts.

source: starting logging thread for device {}
de: starte Datenaufzeichnungs-Thread auf Gerät {}

source: Could not access the device file '{}'.
de: Konnte Gerätedatei '{}' nicht erreichen.

source: Something went wrong with device file '{}'.
de: Etwas hat mit Gerätedatei '{}' nicht funktioniert.

source: running
de: aktiv
fr: en marchant

source: stopped
de: inaktiv
fr: arrêté

source: stopping co2monitor...
de: stoppe co2monitor...
fr: en train d'arrêter co2monitor...

source: stopped co2monitor
de: co2monitor angehalten
fr: co2monitor arrêté

source: idle
de: untätig

source: Request to stop logging on device {} - will terminate soon...
de: Anfrage, die Datenaufzeichnung auf Gerät {} zu beenden - werde bald anhalten...

source: Shutting down logging thread of device {}
de: Fahre Datenaufzeichnungs-Thread auf Gerät {} herunter

source: logging thread for device {} was shut down properly.
de: Datenaufzeichnungsthread für Gerät {} wurde ordentlich heruntergefahren.

source: Starting data logging on device {}
de: Beginne Datenaufzeichnung auf Gerät {}

source: creating data directory
de: erstelle Datenordner

source: created data directory
de: Datenordner erstellt

source: device warmup
de: Geräteaufwärmung

source: giving the device another {} seconds of warmup time...
de: warte noch {} Sekunden, bis das Gerät bereit ist...
fr: J'attends quelques {} secondes pour l'appareil de se réchauffer...

source: opening data file
de: öffne Aufzeichnungsdatei

source: opened data file
de: Aufzeichnungsdatei geöffnet

source: opened {} for data logging.
de: Datei {} zur Datenaufzeichnung geöffnet.
fr: ouvert {} pour enregistrer les données.

source: writing header to file
de: Schreibe Kopfzeile in Aufzeichnungsdatei

source: reading from device
de: lese vom Gerät

source: postprocessing raw data
de: Nachbearbeitung der Rohdaten

source: writing data to file
de: schreibe Daten in Aufzeichnungsdatei

source: stopped logging.
de: Datenaufzeichnung beendet.
fr: enregistrement arrêté.

source: closed data logging file '{}'
de: Datenaufzeichnungsdatei '{}' geschlossen
fr: fichier d'enregistrement '{}' fermé

source: Stopped data logging on device {}
de: beende Datenaufzeichnung auf Gerät {}

source: co2monitor is already running. Aborting.
de: co2monitor läuft bereits. Abbruch.

source: co2monitor is already running
de: co2monitor läuft bereits

source: co2monitor is not running
de: co2monitor läuft nicht
fr: co2monitor ne marche pas

source: trying to start co2monitor via systemd's dbus interface...
de: versuche, co2monitor über das DBus Interface von systemd zu starten...
fr: essai de lancer co2monitor par l'interface dbus de systemd...

source: instructed systemd via dbus to start co2monitor.
de: systemd wurde über dbus angewiesen, co2monitor zu starten.

source: co2monitor was successfully started via systemd's dbus interface.
de: co2monitor erfolgreich über das DBus-Interface von systemd gestartet.

source: co2monitor startup took too long via systemd, didn't work.
de: co2monitor über systemd zu starten, hat zu lange gedauert, nicht funktioniert.

source: starting co2monitor via systemd's dbus interface didn't work.
de: co2monitor über das DBus Interface von systemd zu starten, hat nicht funktioniert.
fr: Lancer co2monitor par l'interface dbus de systemd n'a pas marché.

source: starting co2monitor via 'at now'...
de: starte co2monitor über 'at now'...
fr: lance co2monitor par 'at now'...

source: co2monitor successfully started via 'at now'.
de: co2monitor erfolgreich über 'at now' gestartet.
fr: co2monitor était lancé par 'at now' avec succès.

source: co2monitor startup took too long via 'at now', didn't work.
de: co2monitor über 'at now' zu starten, hat zu lange gedauert, nicht funktioniert.
fr: Lancer co2monitor par 'at now' n'a pas marché, ça durait trop longtemps.

source: no DEVNAME environment variable given. Nothing more to do.
de: keine DEVNAME Umgebungsvariable. Nichts mehr zu tun.

source: DEVNAME environment variable: {}
de: DEVNAME Umgebungsvariable: {}
fr: variable d'environnement DEVNAME: {}

source: DEVNAME environment variable '{}' is a non-existant file. Aborting.
de: DEVNAME Umgebungsvariable '{}' ist keine existierende Datei. Abbruch.

source: co2monitor was started by {}
fr: Co2moniteur était lancé par {}.

source: co2monitor was started by hand
fr: C o2monitor étais lancé á la main.

source: command-line arguments: {}
fr: arguments de ligne de commande: {}

source: setting up device '{}'
fr: installation de l'appareil '{}'
